# -*- coding: utf-8 -*-
"""
Завдання 5.4a

Запросити користувача введення IP-мережі у форматі: 10.1.1.0 255.255.255.0

Потім вивести інформацію про мережу та маску в такому форматі:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Перевірити роботу скрипта на різних комбінаціях мережа/маска.

Вивід має бути впорядкований як у прикладі:
* стовпцями
* ширина стовпця 10 символів (у двійковому форматі треба додати два пробіли між
  стовпцями для поділу октетів між собою)

Приклад роботи завдання:

$ python task_5_4a.py
Enter network address: 10.1.1.0 255.255.255.0

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000


$ python task_5_4a.py
Enter network address: 10.1.1.192 255.255.255.240

Network:
10        1         1         192
00001010  00000001  00000001  11000000

Mask:
/28
255       255       255       240
11111111  11111111  11111111  11110000
"""
var1, var2 = input('Enter IP: ').split()
template1 = """{:<8}  {:<8}  {:<8}  {:<8}"""
template2 = """{:08b}  {:08b}  {:08b}  {:08b}"""
print('Network:')
print(template1.format(*var1.split('.')))
print(template2.format(*[int(x) for x in var1.split('.')]))
print()
print('Mask:')
mask = str(''.join([bin(int(x))[2:] for x in var2.split('.')])).count('1')
print('/'+str(mask))
print(template1.format(*var2.split('.')))
print(template2.format(*[int(x) for x in var2.split('.')]))